<font size=6><b> EXAM

<img src="https://wikidocs.net/images/page/49966/1.png">

* 1. Boston_house.csv 파일을 load해 dataframe으로 생성하시오.

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
df = pd.read_csv("./Boston_house.csv")
df.head(2)

,AGE,B,RM,CRIM,DIS,INDUS,LSTAT,NOX,PTRATIO,RAD,ZN,TAX,CHAS,Target
0,65.2,396.9,6.575,0.00632,4.0900,2.31,4.98,0.538,15.3,1,18.0,296,0,24.0
1,78.9,396.9,6.421,0.02731,4.9671,7.07,9.14,0.469,17.8,2,0.0,242,0,21.6

2. RM컬럼을 정렬 후 상위 1% 출력 == 큰 데이터5개출력

In [3]:
df.shape[0] ,  int( round(len(df) /100, 0) )

(506, 5)

In [4]:
top1_n = int( round(len(df) /100, 0) )
top1_n

5

* 정렬 후 상위 5개

In [5]:
df['RM'].nlargest(top1_n)  #df['RM'].nlargest(5)

364    8.780
225    8.725
257    8.704
262    8.398
163    8.375
Name: RM, dtype: float64

In [6]:
df['RM'].sort_values(ascending=False)[:top1_n]

364    8.780
225    8.725
257    8.704
262    8.398
163    8.375
Name: RM, dtype: float64

* 정렬 후 하위 5개

In [7]:
df['RM'].nsmallest(5)

365    3.561
367    3.863
374    4.138
406    4.138
384    4.368
Name: RM, dtype: float64

In [8]:
df['RM'].sort_values(ascending=True)[:top1_n]

365    3.561
367    3.863
374    4.138
406    4.138
384    4.368
Name: RM, dtype: float64

## 백분위수(Percentile, Quantile)
* 데이터를 오름차순 정렬 후 최소값(0) ~ 최대값(100)의 백분율로 나타낸 위치 값
* 25, 50, 75를 기준 점으로 나눠져 1분위부터 4분위
* pd.quantile( ), np.percentile( )

## QUIZ 
* 전체 데이터 중 (25%),중앙(50%),25%~50%에 위치한 값 출력

### 방법1) np.percentile() 사용

In [9]:
# array likes data, 50%
mylist = [1,2,3,4,5,6,7,8,9,10]
np.percentile(mylist, 50)

5.5

### 방법2) pd.quantile() 사용

In [10]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
test = pd.DataFrame([1,2,3,4,5,6,7,8,9,10], columns=['seq'])
print( test.head()  )
test.head()

   seq
0    1
1    2
2    3
3    4
4    5

   seq
0    1
1    2
2    3
3    4
4    5

In [12]:
print ( "25%:"      ,  test['seq'].quantile(q=0.25, interpolation='nearest') )
print ( "50%중앙값:",  test['seq'].quantile(q=0.5))

q25 = test['seq'].quantile(q=0.25)
q50 = test['seq'].quantile(q=0.5)

#조건: 25%, 50% 포함 사이값 출력

# array
print (  test[(test['seq']>=q25) & (test['seq']<=q50)]['seq'].values  )
# array.reshape(-1) : 2차 [[]]   -->  1차 []
print (  test[(test['seq']>=q25) & (test['seq']<=q50)].values.reshape(-1)  )
# array.reshape(1, -1) : 줄(행):1, 칸(열):-1 칸개수는 무관..자동계산
print (  test[(test['seq']>=q25) & (test['seq']<=q50)].values.reshape(1,-1)  )

25%: 3
50%중앙값: 5.5
[4 5]
[4 5]
[[4 5]]

### 방법3) df.describe().loc() 사용

In [13]:
test.describe()

            seq
count  10.00000
mean    5.50000
std     3.02765
min     1.00000
25%     3.25000
50%     5.50000
75%     7.75000
max    10.00000

In [14]:
desc_df = test.describe()
desc_df.loc["50%"]

seq    5.5
Name: 50%, dtype: float64

3. target 컬럼을 대상으로 평균 이상의 값을 갖는 데이터의 갯수 출력

In [15]:
vmean = df['Target'].mean()   # 22.532806324110677
df[df['Target'] >= vmean]['Target'].count()     
df[df['Target'] >= vmean]['Target'].values.shape[0]  # 또는
len( df[df['Target'] >= vmean]['Target'] )           # 또는

209

4. RM이 3이상이고 CHAS강에 인접한 데이터의 갯수 출력

In [16]:
len(   df[ (df['RM']>=3)  & (df['CHAS'] == 1) ]  )

35

<pre>
<b>선물 판매 온라인 스토어에서  발생한 거래 내역 데이터</b>
• InvoiceNo : 거래 고유 번호
• StockCode : 상품 고유 번호
• Description : 상품명
• Quantity : 거래 수량
• InvoiceDate : 거래 일시
• UnitPrice : 상품 단가
• CustomerID : 구매자 고유 번호
• Country : 구매 국가

In [17]:
odf = pd.read_csv("./Online_retail_mini.csv")
odf.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,South Korea
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,South Korea

5. InvoiceDate 컬럼을 대상으로 년도, 월 정보를 추출 후 InvoiceDate로 오름차순 정렬

* datetime.strptime('2013-01-01 09:10:12', '%Y-%m-%d %H:%M:%S')
* pd.to_datetime('2013-01-01 09:10:12', format='%Y-%m-%d %H:%M:%S')
* odf = pd.read_csv('filename',  parse_dates=['InvoiceDate'])
* odf['InvoiceDate'] = pd.to_datetime(odf['InvoiceDate'])

In [18]:
odf.info()    #InvoiceDate는 object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     object
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

## 방법1) read_csv()

In [19]:
odf = pd.read_csv("./Online_retail_mini.csv", parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

In [20]:
from datetime import datetime
odf['y'] = odf['InvoiceDate'].dt.year
odf['m'] = odf['InvoiceDate'].dt.month
odf[['InvoiceDate','y','m']].sort_values('InvoiceDate', ascending=True)

           InvoiceDate     y   m
0  2010-12-01 08:26:00  2010  12
1  2010-12-01 08:26:00  2010  12
2  2010-12-01 08:26:00  2010  12
3  2010-12-01 08:26:00  2010  12
4  2010-12-01 08:26:00  2010  12
..                 ...   ...  ..
77 2011-12-09 12:50:00  2011  12
78 2011-12-09 12:50:00  2011  12
79 2011-12-09 12:50:00  2011  12
80 2011-12-09 12:50:00  2011  12
82 2011-12-09 12:50:00  2011  12

[83 rows x 3 columns]

## 방법2) object 그데로 처리

In [21]:
odf = pd.read_csv("./Online_retail_mini.csv")  #, parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     object
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

In [22]:
odf['y'] = odf['InvoiceDate'].apply(lambda x : datetime.strptime(x, '%Y-%m-%d %H:%M').year )
odf['m'] = odf['InvoiceDate'].apply(lambda x : datetime.strptime(x, '%Y-%m-%d %H:%M').month )
odf[['InvoiceDate','y','m']].sort_values('InvoiceDate', ascending=True)

         InvoiceDate     y   m
0    2010-12-01 8:26  2010  12
1    2010-12-01 8:26  2010  12
2    2010-12-01 8:26  2010  12
3    2010-12-01 8:26  2010  12
4    2010-12-01 8:26  2010  12
..               ...   ...  ..
77  2011-12-09 12:50  2011  12
78  2011-12-09 12:50  2011  12
79  2011-12-09 12:50  2011  12
80  2011-12-09 12:50  2011  12
82  2011-12-09 12:50  2011  12

[83 rows x 3 columns]

In [23]:
odf['y'] = odf['InvoiceDate'].str[0:4]  #Object(str)
odf['m'] = odf['InvoiceDate'].str[5:7]  #Object(str)
odf[['InvoiceDate','y','m']].sort_values('InvoiceDate', ascending=True)

         InvoiceDate     y   m
0    2010-12-01 8:26  2010  12
1    2010-12-01 8:26  2010  12
2    2010-12-01 8:26  2010  12
3    2010-12-01 8:26  2010  12
4    2010-12-01 8:26  2010  12
..               ...   ...  ..
77  2011-12-09 12:50  2011  12
78  2011-12-09 12:50  2011  12
79  2011-12-09 12:50  2011  12
80  2011-12-09 12:50  2011  12
82  2011-12-09 12:50  2011  12

[83 rows x 3 columns]

## 방법3) pd.to_datetime()

In [24]:
odf = pd.read_csv("./Online_retail_mini.csv")  #, parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     object
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

In [25]:
odf['InvoiceDate'] = pd.to_datetime(odf['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

In [26]:
from datetime import datetime
odf['y'] = odf['InvoiceDate'].dt.year
odf['m'] = odf['InvoiceDate'].dt.month
odf[['InvoiceDate','y','m']].sort_values('InvoiceDate', ascending=True)

           InvoiceDate     y   m
0  2010-12-01 08:26:00  2010  12
1  2010-12-01 08:26:00  2010  12
2  2010-12-01 08:26:00  2010  12
3  2010-12-01 08:26:00  2010  12
4  2010-12-01 08:26:00  2010  12
..                 ...   ...  ..
77 2011-12-09 12:50:00  2011  12
78 2011-12-09 12:50:00  2011  12
79 2011-12-09 12:50:00  2011  12
80 2011-12-09 12:50:00  2011  12
82 2011-12-09 12:50:00  2011  12

[83 rows x 3 columns]

## 방법4) astype('datetime64[ns]')

In [27]:
odf = pd.read_csv("./Online_retail_mini.csv")  #, parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     object
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

In [28]:
odf['InvoiceDate'] = odf['InvoiceDate'].astype('datetime64[ns]')
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

In [29]:
from datetime import datetime
# odf['y'] = odf['InvoiceDate'].dt.year
# odf['m'] = odf['InvoiceDate'].dt.month
odf['y'] = odf['InvoiceDate'].dt.strftime('%Y') 
odf['m'] = odf['InvoiceDate'].dt.strftime('%m') 
odf[['InvoiceDate','y','m']].sort_values('InvoiceDate', ascending=True)

           InvoiceDate     y   m
0  2010-12-01 08:26:00  2010  12
1  2010-12-01 08:26:00  2010  12
2  2010-12-01 08:26:00  2010  12
3  2010-12-01 08:26:00  2010  12
4  2010-12-01 08:26:00  2010  12
..                 ...   ...  ..
77 2011-12-09 12:50:00  2011  12
78 2011-12-09 12:50:00  2011  12
79 2011-12-09 12:50:00  2011  12
80 2011-12-09 12:50:00  2011  12
82 2011-12-09 12:50:00  2011  12

[83 rows x 3 columns]

6. 구매국가(Country) 컬럼의 값을 수치값으로 변환

* replace()
* map()
* apply(lambda x:)
* LabelEncoder()
* astype('category')

In [30]:
odf = pd.read_csv("./Online_retail_mini.csv", parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

## 방법1) replace([원본], [변경])

In [31]:
odf['Country'].value_counts()

United Kingdom    34
South Korea       16
Austria           13
France            11
Germany            9
Name: Country, dtype: int64

In [32]:
odf['Country'].value_counts().index

Index(['United Kingdom', 'South Korea', 'Austria', 'France', 'Germany'], dtype='object')

In [33]:
odf['Country2'] = odf['Country'].replace( ['United Kingdom', 'South Korea', 'Austria', 'France', 'Germany'],
                                         [0,1,2,3,4] )
odf[['Country','Country2']].value_counts()

Country         Country2
United Kingdom  0           34
South Korea     1           16
Austria         2           13
France          3           11
Germany         4            9
dtype: int64

## 방법2) map(dict)

In [34]:
odf['Country'].value_counts().index.values

array(['United Kingdom', 'South Korea', 'Austria', 'France', 'Germany'],
      dtype=object)

In [35]:
# dict(  enumerate(odf['Country'].value_counts().index.values)   )

In [36]:
clist = odf['Country'].value_counts().index.values
clist
mydic = {}
for i,cname in enumerate(clist) :
    #print(i, cname)
    mydic[cname] = i
mydic

{'United Kingdom': 0,
 'South Korea': 1,
 'Austria': 2,
 'France': 3,
 'Germany': 4}

In [37]:
odf['Country3'] = odf['Country'].map(mydic)

In [38]:
odf[['Country','Country2','Country3']].value_counts()

Country         Country2  Country3
United Kingdom  0         0           34
South Korea     1         1           16
Austria         2         2           13
France          3         3           11
Germany         4         4            9
dtype: int64

## 방법3) apply(lambda x:)

In [39]:
def myfunc(x) :
    code = 0
    if x == 'United Kingdom': 
        code = 0
    elif x == 'South Korea': 
        code = 1
    elif x == 'Austria': 
        code = 2
    elif x == 'France': 
        code = 3
    elif x == 'Germany': 
        code = 4
    return code
myfunc('Germany')

4

In [40]:
odf['Country4'] = odf['Country'].apply(lambda x : myfunc(x))
odf[['Country','Country2','Country3','Country4']].value_counts()

Country         Country2  Country3  Country4
United Kingdom  0         0         0           34
South Korea     1         1         1           16
Austria         2         2         2           13
France          3         3         3           11
Germany         4         4         4            9
dtype: int64

## 방법4) LabelEncoder()

In [41]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
le.fit(odf['Country'])
res = le.transform(odf['Country'])
print(  res  )
odf['Country5'] = res

# 사전순이라 상위 결과와 다를 수 있다
odf[['Country','Country2','Country3','Country4','Country5']].value_counts()

[3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 4 4 4 4 4 4 4 4 2 2 2 2 2 2 2 2 2 4 4 4 4
 4 4 4 0 0 0 0 0 0 0 0 0 0 0 0 0 4 4 4 4 4 4 4 4 4 4 1 1 1 1 1 4 4 4 4 4 4
 4 4 4 1 1 1 1 1 1]

Country         Country2  Country3  Country4  Country5
United Kingdom  0         0         0         4           34
South Korea     1         1         1         3           16
Austria         2         2         2         0           13
France          3         3         3         1           11
Germany         4         4         4         2            9
dtype: int64

## 방법5) astype('category')

In [42]:
odf['Country6'] = odf['Country'].astype('category').cat.codes

# 사전순이라 상위 결과와 다를 수 있다
odf[['Country','Country2','Country3','Country4','Country5','Country6']].value_counts()

Country         Country2  Country3  Country4  Country5  Country6
United Kingdom  0         0         0         4         4           34
South Korea     1         1         1         3         3           16
Austria         2         2         2         0         0           13
France          3         3         3         1         1           11
Germany         4         4         4         2         2            9
dtype: int64

7. Object 타입을 갖는 컬럼들에 대해 각 컬럼들이 갖는 고유값의 크기 출력  
예) gen : f f f m m 값을 갖는 경우 gen 2  
예) gubun : P P P Q S Q 값을 갖는 경우 gubun 3

In [43]:
odf = pd.read_csv("./Online_retail_mini.csv", parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

In [44]:
odf.select_dtypes("object").nunique()

InvoiceNo      19
StockCode      80
Description    81
Country         5
dtype: int64

In [45]:
odf.select_dtypes("object").columns

for col in odf.select_dtypes("object").columns:
    print(col, "\t" , odf[col].nunique())

InvoiceNo 	 19
StockCode 	 80
Description 	 81
Country 	 5

8. 거래일시(InvoiceDate) 컬럼을 대상으로 년월별 거래 횟수 출력 후 최근일자 순으로 정렬

In [46]:
odf = pd.read_csv("./Online_retail_mini.csv", parse_dates=['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

* InvoiceDate 타입이 object인 경우
* <font color=red><b> odf['InvoiceDate'] = odf['InvoiceDate'].astype("str")

In [47]:
odf['InvoiceDate'] = odf['InvoiceDate'].astype("str")
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     object
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

In [48]:
odf['InvoiceDate'].str[0:7].value_counts().sort_index(ascending=False)

2011-12     6
2011-07     5
2011-05    19
2011-04    37
2010-12    16
Name: InvoiceDate, dtype: int64

* InvoiceDate 타입이 datetime64[ns]인 경우

In [49]:
odf['InvoiceDate'] = pd.to_datetime(odf['InvoiceDate'])
odf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    83 non-null     object
 1   StockCode    83 non-null     object
 2   Description  83 non-null     object
 3   Quantity     83 non-null     int64
 4   InvoiceDate  83 non-null     datetime64[ns]
 5   UnitPrice    81 non-null     float64
 6   CustomerID   76 non-null     float64
 7   Country      83 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 5.3+ KB

In [50]:
from datetime import datetime
odf['y'] =  odf['InvoiceDate'].dt.year
odf['m'] =  odf['InvoiceDate'].dt.month
odf[['y', 'm']].value_counts().sort_index(ascending=False)

y     m
2011  12     6
      7      5
      5     19
      4     37
2010  12    16
dtype: int64

In [51]:
odf['ym'] = odf['InvoiceDate'].dt.strftime('%Y-%m') 
odf['ym'].value_counts().sort_index(ascending=False)

2011-12     6
2011-07     5
2011-05    19
2011-04    37
2010-12    16
Name: ym, dtype: int64

9. 구매자 고유 번호(CustomerID)가 결측인 회원값을 최빈도 값으로 대채

* 결측이 있는 컬럼

In [52]:
odf.isna().sum() [ odf.isna().sum() > 0 ]

UnitPrice     2
CustomerID    7
dtype: int64

## 방법1) df.fillna(변경값, inplace=True)

In [53]:
mode_cid = odf['CustomerID'].mode().values[0]   #12429.0
odf['CustomerID'] = odf['CustomerID'].fillna(mode_cid)
odf.loc[ [22, 23, 72, 73, 74, 75, 76] ]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,y,m,ym
22,551019,22467,wrong code?,-100,2011-04-26 11:19:00,NaN,12429.0,United Kingdom,2011,4,2011-04
23,551020,22719,wrong code,-110,2011-04-26 11:19:00,NaN,12429.0,United Kingdom,2011,4,2011-04
72,558810,21733,RED HANGING HEART T-LIGHT HOLDER,1,2011-07-04 11:11:00,5.79,12429.0,United Kingdom,2011,7,2011-07
73,558810,21755,LOVE BUILDING BLOCK WORD,1,2011-07-04 11:11:00,11.63,12429.0,United Kingdom,2011,7,2011-07
74,558810,21929,JUMBO BAG PINK VINTAGE PAISLEY,5,2011-07-04 11:11:00,4.13,12429.0,United Kingdom,2011,7,2011-07
75,558810,21930,JUMBO STORAGE BAG SKULLS,5,2011-07-04 11:11:00,4.96,12429.0,United Kingdom,2011,7,2011-07
76,558810,21931,JUMBO STORAGE BAG SUKI,8,2011-07-04 11:11:00,4.13,12429.0,United Kingdom,2011,7,2011-07

## 방법2) df.loc( [idx,idx] ) =  변경값

* CustomerID 가 결측인 레코드 수

In [54]:
odf['CustomerID'].isna().sum()

0

* CustomerID 가 결측인 데이터의 인덱스 출력

In [55]:
na_idx = odf[odf['CustomerID'].isna()].index.values
na_idx

array([], dtype=int64)

* CustomerID  최빈도

In [56]:
mode_cid = odf['CustomerID'].mode().values[0]
mode_cid

12429.0

In [57]:
odf.loc[ [22, 23, 72, 73, 74, 75, 76], 'CustomerID' ] = mode_cid
odf.loc[ [22, 23, 72, 73, 74, 75, 76] ]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,y,m,ym
22,551019,22467,wrong code?,-100,2011-04-26 11:19:00,NaN,12429.0,United Kingdom,2011,4,2011-04
23,551020,22719,wrong code,-110,2011-04-26 11:19:00,NaN,12429.0,United Kingdom,2011,4,2011-04
72,558810,21733,RED HANGING HEART T-LIGHT HOLDER,1,2011-07-04 11:11:00,5.79,12429.0,United Kingdom,2011,7,2011-07
73,558810,21755,LOVE BUILDING BLOCK WORD,1,2011-07-04 11:11:00,11.63,12429.0,United Kingdom,2011,7,2011-07
74,558810,21929,JUMBO BAG PINK VINTAGE PAISLEY,5,2011-07-04 11:11:00,4.13,12429.0,United Kingdom,2011,7,2011-07
75,558810,21930,JUMBO STORAGE BAG SKULLS,5,2011-07-04 11:11:00,4.96,12429.0,United Kingdom,2011,7,2011-07
76,558810,21931,JUMBO STORAGE BAG SUKI,8,2011-07-04 11:11:00,4.13,12429.0,United Kingdom,2011,7,2011-07

10. Quantity(거래수량)이 가장 큰 상품들의 상품명(Description), 가격정보(UnitPrice) 출력

In [58]:
# odf [ odf['Quantity'] == 128  ] [['Description','UnitPrice']]

max_val = odf['Quantity'].max()
odf [ odf['Quantity'] == max_val  ] [['Description','UnitPrice']]

                           Description  UnitPrice
33  WHITE HANGING HEART T-LIGHT HOLDER       2.55